//CERT1 JOB 1,OGDEN,MSGCLASS=X
//CRECERTS EXEC PGM=IKJEFT1A
//SYSTSPRT DD SYSOUT=*
//SYSTSIN DD *
SETROPTS CLASSACT(DIGTCERT) RACLIST(DIGTCERT)
 
RACDCERT GENCERT CERTAUTH +
  BJECTSDN(CN('TN3270_signer')) +
  WITHLABEL('TN3270_signerCA') +  
  NOTAFTER(DATE(2029/12/31)) SIZE(2048)
SETROPTS RACLIST(DIGTCERT) REFRESH

RACDCERT GENCERT ID(START1) +
  SUBJECTSDN(CN(‘S0W1.OGDEN.IBM')) +
  WITHLABEL('TN3270TLS') +
  SIGNWITH(CERTAUTH LABEL('TN3270_signerCA')) +
  NOTAFTER(DATE(2029/12/31)) SIZE(2048)
SETROPTS RACLIST(DIGTCERT) REFRESH

RACDCERT ADDRING(TN3270TLSring) ID(START1)
  SETROPTS RACLIST(DIGTCERT) REFRESH

RACDCERT CONNECT(CERTAUTH LABEL('TN3270_signerCA') +
  RING(TN3270TLSring) CERTAUTH) ID(START1)
SETROPTS RACLIST(DIGTCERT) REFRESH

RACDCERT CONNECT(ID(START1) LABEL('TN3270TLS') +
  RING(TN3270TLSring) DEFAULT) ID(START1)
SETROPTS RACLIST(DIGTCERT) REFRESH

RACDCERT EXPORT(LABEL('TN3270_signerCA')) CERTAUTH +
    
    DSN('OGDEN.CERT.B64') FORMAT(CERTB64)
/*
